##  Data cleaning assignment ##



<center><img src="https://raw.githubusercontent.com/utpalathacker25/Projects_DataScience/main/iNeuron/Image/Datacleaning%20with%20Python.jpg?raw=true" width="700" height="300" /></center>


**<u>Problem Statement:**<u>

It happens all the time: someone gives you data containing malformed strings,Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:
-  df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [1]:
# Install Libraries & Importing Packages :- #

import pandas as pd
import numpy as np

In [2]:
# DataFrame Creation:- #

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. 
Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and    10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float          column)

In [4]:
# Make copy of dataframe for Ques:1:-#

df1=df.copy()

# replacing values based on indexing:-#

df1.iloc[1,1]='10055'
df1.iloc[3,1]='10075'

In [5]:
df1

            From_To FlightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN        10055            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis        10075          [13]       12. Air France
4   Brussels_londOn        10085      [67, 32]          "Swiss Air"

In [6]:
df1.shape

(5, 4)

2. 
The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct

In [7]:
# Make copy of dataframe for Ques:2:-#

df2=df1.copy()

In [8]:
df2

            From_To FlightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN        10055            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis        10075          [13]       12. Air France
4   Brussels_londOn        10085      [67, 32]          "Swiss Air"

In [9]:
df2.From_To

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [10]:
# Spliting From_To into two different columns i.e From & To :-#

df2[['From','To']] = df2.From_To.str.split("_",expand=True)

In [11]:
df2

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

3. 
Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is suppercase (e.g. "londON" should become "London".)

In [12]:
# Make copy of dataframe for Ques:3:-#

df3=df2.copy()

In [13]:
df3

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [14]:
# Capitalize 1st letter of the word in the column "From":-#

df3['From'] = df3['From'].str.capitalize()

In [15]:
df3

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [16]:
# Make copy of dataframe for Ques:4:-#

df4=df3.copy()

In [17]:
df4

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [18]:
# Deleting From_To column :-#

df4.drop('From_To', axis=1, inplace=True)

In [19]:
df4

  FlightNumber  RecentDelays              Airline      From         To
0        10045      [23, 47]               KLM(!)    London      paris
1        10055            []    <Air France> (12)    Madrid      miLAN
2        10065  [24, 43, 87]  (British Airways. )    London  StockhOlm
3        10075          [13]       12. Air France  Budapest      PaRis
4        10085      [67, 32]          "Swiss Air"  Brussels     londOn

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

    Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [20]:
# Make copy of dataframe for Ques:5:-#

df5=df4.copy()

In [21]:
len(df5.RecentDelays)

5

In [22]:
# Spliting RecentDelays into n=3 different columns i.e delays_1,delays_2,delays_3 :-#
delays = pd.DataFrame(df5['RecentDelays'].values.tolist(), columns=['delays_1','delays_2','delays_3'])

In [23]:
delays

   delays_1  delays_2  delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [24]:
df5.drop(columns =["RecentDelays"], inplace = True)
df5=pd.concat([df5, delays], axis=1, join_axes=[df.index])

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

In [25]:
 df5

,FlightNumber,Airline,From,To,delays_1,delays_2,delays_3
0,10045,KLM(!),London,paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,miLAN,NaN,NaN,NaN
2,10065,(British Airways. ),London,StockhOlm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,londOn,67.0,32.0,NaN

**THANK YOU**

Utpala Thacker